#+title: rCore Journal
** Rust 中字符表示
字符可以用 ASCII 码和 Unicode 码定义，'2A' 为 ASCII 码表中表示符号 '*' 的十六进制数，格式为 '\xHH' 。'151' 是 Unicode 十六进制码，格式为 '\u{HHH}' 。
#+BEGIN_SRC rust
// 在Emacs 中按 C-c C-c 查看运行结果
fn main() {
    println! {"\u{151}"};
    println! {"\x2A"};
    println! {"\u{CA0}"};
    println! {"咕咕咕"};
}
#+END_SRC

#+RESULTS:
: ő
: *
: ಠ
: 咕咕咕

